docs/tomoko/make_our_help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<title>hogehoge</title>
<!-- 2018-09-27 木 14:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="name" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">hogehoge</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. README.org</a>
<ul>
<li><a href="#sec-1-1">1.1. 記述</a></li>
<li><a href="#sec-1-2">1.2. html生成</a></li>
</ul>
</li>
<li><a href="#sec-2">2. sotsuken TODO</a>
<ul>
<li><a href="#sec-2-1">2.1. miniとの同期</a>
<ul>
<li><a href="#sec-2-1-1">my_help upload command</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. 全部集める，共有</a>
<ul>
<li><a href="#sec-2-2-1">github</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. 見せる</a>
<ul>
<li><a href="#sec-2-3-1">web</a>
<ul>
<li><a href="#sec-2-3-1-1">point ranking</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. 選ぶ</a></li>
<li><a href="#sec-2-5">2.5. pull</a></li>
</ul>
</li>
<li><a href="#sec-3">3. etc</a>
<ul>
<li><a href="#sec-3-1">3.1. my_helpの改善</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> README.org</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 記述</h3>
<div class="outline-text-3" id="text-1-1">
<p>
全ての基本となるREADME.orgの雛形．
</p>

<p>
拡張によって追加する方がいいのか，あるいはあらかじめ
記述があって，さらに使い方の基本みたいなのがあるのがいいよね．
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> html生成</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>c-c c-e h(tml) o(ut)
</li>
</ul>
<p>
で生成してくれる．
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> sotsuken TODO</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> miniとの同期</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">my_help upload command</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
今あるgithubアカウントにminiの方も繋いだ．
そこで，公開リポジトリour_helpを作成．(.gitignoreなし)
our_help/memberというディレクトリの中に各自のディレクトリを作り，そこに.my_help内のmemoを蓄積していく．
</p>

<p>
下記の動作は無しにする．
</p>
<ul class="org-ul">
<li>共有を行いたい，my_mac:~/.my_help にあるファイルを mini:~/our_help/member/DIRECTORY_NAME にscpする.
</li>
<li>rsync(どういう動きをするのか調べる)
</li>
</ul>

<p>
mini:~/以降がベタ打ちなので，要修正．
my_help upload FILE_NAME DIRECTORY_NAME で動く様にしたい．
</p>

<ul class="org-ul">
<li>mini:~/our_help内でpushする．
</li>
</ul>

<p>
自分のserver上のGitレポジトリを作ってそこにPushする(<a href="https://qiita.com/gymnstcs/items/38d91783d08e2d628fa5">https://qiita.com/gymnstcs/items/38d91783d08e2d628fa5</a>)
これでminiと.my_help上にtest.gitを作ってつなぐ．
</p>

<p>
’もしも同じマシン上にGitRepoのRemoteを作りたい場合には、以下のようにサーバホストを書かなければよい。
git remote add origin /path/to/test.git’
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 全部集める，共有</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">github</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
mini:/our_help/members/
</p>
<ul class="org-ul">
<li>permissionをどうするか．とりあえず研究室memberでmy_helpを溜め込む．
</li>
</ul>

<p>
githubにデータを置く問題
</p>
<ul class="org-ul">
<li>githubはplain textではなく，変換してある．(git cloneで引き出せる) 
</li>
<li>めっちゃファイル溜まってきたらどうする？
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 見せる</h3>
<div class="outline-text-3" id="text-2-3">
<p>
全部cuiやと見づらい．lsはしんどい．
</p>
</div>


<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">web</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
orgでmocを書く．
</p>
<ul class="org-ul">
<li>ruby on railsでmoc作成する．
</li>
</ul>
<p>
webで見やすく．内容に難易度をつける．
検索画面．
</p>
</div>

<div id="outline-container-sec-2-3-1-1" class="outline-5">
<h5 id="sec-2-3-1-1">point ranking</h5>
<div class="outline-text-5" id="text-2-3-1-1">
<p>
our_helpの更新を促進させるための機能．まだ．
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 選ぶ</h3>
<div class="outline-text-3" id="text-2-4">
<p>
内容で選ぶことができる様にweb表示．
</p>
<ul class="org-ul">
<li>内容のキーワード検索を行える様にしたい．
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> pull</h3>
<div class="outline-text-3" id="text-2-5">
<p>
githubにデータを置いておいて，欲しいやつだけgit cloneとか．．．．
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> etc</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> my_helpの改善</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>my_help search
</li>
</ul>
<p>
を追加する．
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: name</p>
<p class="date">Created: 2018-09-27 木 14:40</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
